;---------------------------------BEGIN: EMCC\Caliset-----------------------------------------
[CALISET_DLG_102]
CAPTION=HL校正软件
ID1022=方案集
ID1023=请选择:
ID1007=另存为
ID1017=删除
ID1084=导入
ID1085=导出

ID1075=校正头
ID1024=基本参数
ID1025=校正范围(mm):
ID1026=打标范围(mm):
ID1072=坐标系
ID1077=旋转角度
ID1079=X偏移(mm)
ID1080=Y偏移(mm)
ID1119=振镜1=X
ID1120=振镜2=X
ID1116=反向
ID1117=反向

ID1030=网格及级别校正（选中缩放比例后双击可弹出自动计算窗口）
ID1009=添加级别
ID1010=删除级别
ID1012=多级整体效果
ID1031=回字级数:
ID1018=最大级别打标TEXT图形, 其他级别打标回字图形

ID1053=红光校正
ID1043=启用
ID1054=X缩放比:
ID1055=Y缩放比:
ID1056=X偏移量(mm):
ID1057=Y偏移量(mm):

ID1058=调焦
ID1065=聚焦方式
ID1059=动态调焦类型
ID1060=控制模式
ID1061=振镜轴间距(mm)
ID1082=方头到工作平面高度(mm)
ID1063=微调值(um)
ID1062=动态调焦补偿系数

ID1011=测试 F7
ID1037=停止
ID1014=参数>>

ID1109=校正类型
ID1099=普通校正
ID1100=高精度校正1[扫描仪]
ID1101=高精度校正[导入真实坐标数据]
ID1110=高精度校正说明：1、首先选择普通校正进行常规的校正，对坐标系、红光校正、BOX大小及变形进行初步调整。2、选择高精度校正，生成网格点。3、用不同的工具获得数据并进行处理后，将数据导入。
ID1114=直接导入高精度校正数据

ID1089=高精度校正
ID1086=生成网格点
ID1111=第一步:生成网格点。
ID1112=第二步:导入扫描仪或者二次元测量出的真实坐标数据。
ID1113=第三步:创建高精度校正表并确认保存退出。

ID1096=缩放
ID1027=高精度打标范围(mm)
ID1097=凹凸
ID1028=测试BOX大小(mm):
ID1091=导入扫描仪处理后数据
ID1087=导入数据
ID1016=创建高精度校正表
ID1139=生成校正表

ID1=确定
ID2=取消
ID1142 = 打标控制

[CALISET_DLG_167]
CAPTION=高精度数据导入
ID1114=二次元获取的X坐标文件：
ID1115=二次元获取的Y坐标文件：
ID1=确定
ID2=取消

[CALISET_DLG_159]
CAPTION=保存方案
ID1036=校正方案另存为:
ID1=确定
ID2=取消

[CALISET_DLG_131]
CAPTION=打标参数
ID1032=打标次数:
ID1033=打标速度(mm/s)
ID1035=功率(%)
ID1034=Q频(KHz)
ID1036=Q释放时间(us)
ID1037=激光关延时(us)
ID1=确定
ID2=取消

[CALISET_DLG_160]
CAPTION=设置点阵打标行列信息
ID1093=行数
ID1094=列数
ID1116=仅设置行列数,不打标
ID1=打标
ID2=取消
ID1099=点
ID1100=十字
ID1101=圆

[CALISET_DLG_164]
CAPTION=选择控制卡
ID1098=请选择工作卡：
ID1=确定
ID2=取消


[CALISET_STRINGTABLE]
ID0=BOX大小(mm)
ID1=X缩放比例％
ID2=Y缩放比例％
ID3=X凹凸
ID4=Y凹凸
ID5=X梯形
ID6=Y梯形
ID7=X平行
ID8=Y平行
ID9=X正向比例％
ID10=X负向比例％
ID11=Y正向比例％
ID12=Y负向比例％
ID13=参数\级别
ID14 = 电流(A)
ID15 =功率(%)
ID16 = 电流(%)
ID17 = 激光脉宽(ns)
ID18 = 激光模式
ID999=已经有打标软件或校正软件正在运行,请先关闭!
ID1000=打标库文件丢失或损坏，请确认软件是否正常!
ID1001=打标控制卡初始化失败!
ID1002=打标控制卡系统设置失败!
ID1003=请先选择要测试的校正级别!
ID1004=操作失败，请稍后再试!
ID1005=已存在该方案名，覆盖吗?	
ID1006=校正范围不能为0!	
ID1007=打标范围不能为0!
ID1008=校正范围和打标范围的比例系数不对，校正范围必须是打标范围的%.3f倍上!
ID1011=请选择要删除级别
ID1012=请至少保留一级校正!
ID1013=文件错误!
ID1014=设定校正数据到卡失败，请稍后重试!	
ID1015=该校正配置方案与当前软件版本不一致，是否强制读入吗?
ID1016=BOX大小不能超出打标范围!
ID1017=BOX大小不能超出上一级大小!
ID1018=当前校正设置已经修改，保存吗?
ID1019=读取文件失败!
ID1020=确认删除当前方案吗?
ID1021=没有检测到软件狗!
ID1022=检测到软件狗，但不是合法的软件狗!
ID1023=插入的合法软件狗多于1个!
ID1024=将初始狗转换成运行狗失败!
ID1025="当前软件授权已到期，需要联系大族客服人员，重新申请与（狗ID=%s，校验码=%s）匹配的许可授权补丁，以便继续使用"
ID1026="D160"
ID1027="D480"
ID1028="CO2增强"
ID1029="CO2传统"
ID1030="打标失败"
ID1031=BOX大小不能小于下一级大小!
ID1032=超出有效校正区域
ID1033="fθ后聚焦"
ID1034="3D动态调焦"
ID1035="普通后聚焦"
ID1036="简便激光器控制模式下BOX大小必须小于打标范围%dmm"
ID1037="获取卡内保存的狗ID失败,请检查卡是否被绑定过"
ID1038="导入失败"
ID1039="导入成功"
ID1040="导出失败"
ID1041="导出成功"
ID1042="操作失败"
ID1043="文件数据不匹配"
ID1044="后聚焦3D"
ID1045="X坐标文件路径为空!"
ID1046="Y坐标文件路径为空!"
ID1047="卡上的狗号跟加密狗狗号不一致"
ID1048="卡上的卡号为空或长度不对"

;---------------------------------End: EMCC\Caliset-----------------------------------------

[error]
1=卡未初始化或找不到卡！
2=复位失败！
3=卡版本不对！
4=报警！
6=执行失败！
7=状态不对应!
16=命令超时！
17=命令丢失!
18=接口调用异步！
19=接口被其它程序占用!
20=Z轴超限或校正文件损坏！
21=参数不匹配!
23=内存分配失败!
100=脱机使用中!
101=命令被中止!
1001=端口1
1002=端口2
1003=端口3
1004=端口4
1005=端口5
1006=端口6
1007=端口7
1008=激光输入没有准备好
1009=激光输入准备就绪

[4]
1 = 激光器过温，请关闭电源！
2 = 激光器高反报警，请关闭电源！
3 = 激光器MO异常，请关闭电源！
4 = 激光器盖子被打开，请关闭电源并装好激光器盖子！
5 = 安全门被打开，请关上安全门！
6 = 光闸关闭异常，请关闭电源并检查光闸！
7 = 光闸打开异常，请关闭电源并检查光闸！
8 = 安全门被打开，打标暂停，请关上安全门继续打标！
9 = 安全门被打开，打标中止！
10= 激光器系统报警，请关闭电源！
11= 激光器电源电压超范围，请关闭电源！
12= 激光器电源过压报警，请关闭电源并检查激光器电源！
13= 激光器电源欠压报警，请关闭电源并检查激光器电源！
14= SPI激光器过温报警，请关闭电源！
15= SPI激光器预备放大器过流报警，请关闭电源！
16= SPI激光器功率放大器过流报警，请关闭电源！
17= SPI激光器准直激光器报警，请关闭电源！
18= SPI激光器保留报警，请关闭电源！
19= SPI激光器电源报警，请关闭电源！
20= 激光器未知报警，请关闭电源！
21= 激光器电源过流报警，请关闭电源！
22= 激光器电源过压报警，请关闭电源！
23= 激光器电源过温报警，请关闭电源并检查散热条件！
24= 激光器电源未打开，请检查电源。
30= 运动过程中碰到负限位，打标被中止！
31= 运动过程中碰到正限位，打标被中止！
32= 电机脉冲超范围
33= 振镜DA超范围！
34= 平台X轴超正限位！
35= 平台X轴超负限位！
36= 平台Y轴超正限位！
37= 平台Y轴超负限位！
38= 振镜方头上电异常，请关闭电源并检查！
54=请切换到512校正表!
55=请切换到128校正表!
100=安全门有效且被打开!

110=碰到负限位!
111=碰到正限位!
112=运动中碰到原点!
500=振镜预热中，请稍侯再试!

[door]
1=安全门被打开，请关上安全门！
2=安全门被打开，打标暂停，请关上安全门继续打标！
3=安全门被打开，打标中止！
4=安全门已关上,可以继续打标！
5=安全门已关上,状态正常！
6=运动过程中碰到负限位，打标被中止！
7=运动过程中碰到正限位，打标被中止！

[usb]
1=EMCC卡已经连接
2=EMCC卡已经断开

[4101]
3=DA卡1功能与版本信息
4=DA卡1版本日期信息
5=DA卡1的运行时间
7=DA卡1的误码帧数
9=DA卡1倒数第4次误码的时间
11=DA卡1倒数第3次误码的时间
13=DA卡1倒数第2次误码的时间
15=DA卡1最后一次误码的时间

[4102]
4=DA卡1的失码帧数
6=DA卡1倒数第4次失码的时间
8=DA卡1倒数第3次失码的时间
10=DA卡1倒数第2次失码的时间
12=DA卡1最后一次失码的时间
14=DA卡1振镜报警信息
15=DA卡1振镜报警关激光使能

[4103]
3=DA卡2功能与版本信息
4=DA卡2版本日期信息
5=DA卡2的运行时间
7=DA卡2的误码帧数
9=DA卡2倒数第4次误码的时间
11=DA卡2倒数第3次误码的时间
13=DA卡2倒数第2次误码的时间
15=DA卡2最后一次误码的时间

[4104]
4=DA卡2的失码帧数
6=DA卡2倒数第4次失码的时间
8=DA卡2倒数第3次失码的时间
10=DA卡2倒数第2次失码的时间
12=DA卡2最后一次失码的时间
14=DA卡2振镜报警信息
15=DA卡2振镜报警关激光使能

[4105]
3=LASER卡功能与版本信息
4=LASER卡版本日期信息
5=LASER卡的运行时间
7=LASER卡的误码帧数
9=LASER卡倒数第4次误码的时间
11=LASER卡倒数第3次误码的时间
13=LASER卡倒数第2次误码的时间
15=LASER卡最后一次误码的时间

[4106]
4=LASER卡的失码帧数
6=LASER卡倒数第4次失码的时间
8=LASER卡倒数第3次失码的时间
10=LASER卡倒数第2次失码的时间
12=LASER卡最后一次失码的时间
14=LASER卡振镜报警信息
15=LASER卡激光器报警关激光使能

[4107]
3=LASER卡激光器当前ns波形
4=LASER卡激光器当前ps波形
5=LASER卡激光器当前fs波形
6=LASER卡激光器当前维持功率



[4102Warning]
0=D0:DA卡1 数据通讯异常
1=D1:DA卡1 Scanner系统报警
2=D2:DA卡1 Scanner温度报警
3=D3:DA卡1 Scanner低速报警
4=D4:未使用
5=D5:未使用
6=D6:未使用
7=D7:未使用
8=D8:未使用
9=D9:未使用
10=D10:未使用
11=D11:未使用
12=D12:未使用
13=D13:未使用
14=D14:未使用
15=D15:EMCC卡 数据通讯异常

[4104Warning]
0=D0:DA卡2 数据通讯异常
1=D1:DA卡2 Scanner系统报警
2=D2:DA卡2 Scanner温度报警
3=D3:DA卡2 Scanner低速报警
4=D4:未使用
5=D5:未使用
6=D6:未使用
7=D7:未使用
8=D8:未使用
9=D9:未使用
10=D10:未使用
11=D11:未使用
12=D12:未使用
13=D13:未使用
14=D14:未使用
15=D15:未使用

[4106Warning]
0=D0:LASER卡 数据通讯异常
1=D1:激光器温度报警
2=D2:电源报警
3=D3:系统报警
4=D4:高反报警
5=D5:激光器未准备好
6=D6:种子激光点火失败
7=D7:种子激光温度报警
8=D8:MO过流报警
9=D9:PA过流报警
10=D10:准直器报警
11=D11:保留报警5
12=D12:保留报警4
13=D13:保留报警3
14=D14:保留报警2
15=D15:保留报警1

[Refresh]
Interval=500



